// ConsoleApplication1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main() {
	float num1, num2, res; 
	std::cout << "Add number: ";
	std::cin >> num1;

	std::cout << "Add number: ";
	std::cin >> num2;

	char math;
	std::cout << "Add math: ";
	std::cin >> math;

	if (math == '+')
		res = num1 + num2;
	else if (math == '-')
		res = num1 - num2;
	else if (math == '*')
		res = num1 * num2;
	else if (math == '/')
		res = num1 / num2;

	std::cout << "Resultat: " << res;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
